grevaillot/svd_tools/headers/STM32H7x7_CM7/adc3.h
#pragma once 

/* --- ADC3: Analog to Digital Converter ---------------------------- */

/** @defgroup adc3_registers Analog to Digital Converter Register
@{*/

/** ADC3_ISR ADC interrupt and status register **/
#define ADC3_ISR			MMIO32(ADC3_BASE + 0x00)
/** ADC3_IER ADC interrupt enable register **/
#define ADC3_IER			MMIO32(ADC3_BASE + 0x04)
/** ADC3_CR ADC control register **/
#define ADC3_CR			MMIO32(ADC3_BASE + 0x08)
/** ADC3_CCR ADC common control register **/
#define ADC3_CCR			MMIO32(ADC3_BASE + 0x08)
/** ADC3_CFGR ADC configuration register 1 **/
#define ADC3_CFGR			MMIO32(ADC3_BASE + 0x0c)
/** ADC3_CFGR2 ADC configuration register 2 **/
#define ADC3_CFGR2			MMIO32(ADC3_BASE + 0x10)
/** ADC3_SMPR1 ADC sampling time register 1 **/
#define ADC3_SMPR1			MMIO32(ADC3_BASE + 0x14)
/** ADC3_SMPR2 ADC sampling time register 2 **/
#define ADC3_SMPR2			MMIO32(ADC3_BASE + 0x18)
/** ADC3_PCSEL ADC pre channel selection register **/
#define ADC3_PCSEL			MMIO32(ADC3_BASE + 0x1c)
/** ADC3_LTR1 ADC analog watchdog 1 threshold register **/
#define ADC3_LTR1			MMIO32(ADC3_BASE + 0x20)
/** ADC3_LHTR1 ADC analog watchdog 2 threshold register **/
#define ADC3_LHTR1			MMIO32(ADC3_BASE + 0x24)
/** ADC3_SQR1 ADC group regular sequencer ranks register 1 **/
#define ADC3_SQR1			MMIO32(ADC3_BASE + 0x30)
/** ADC3_SQR2 ADC group regular sequencer ranks register 2 **/
#define ADC3_SQR2			MMIO32(ADC3_BASE + 0x34)
/** ADC3_SQR3 ADC group regular sequencer ranks register 3 **/
#define ADC3_SQR3			MMIO32(ADC3_BASE + 0x38)
/** ADC3_SQR4 ADC group regular sequencer ranks register 4 **/
#define ADC3_SQR4			MMIO32(ADC3_BASE + 0x3c)
/** ADC3_DR ADC group regular conversion data register **/
#define ADC3_DR			MMIO32(ADC3_BASE + 0x40)
/** ADC3_JSQR ADC group injected sequencer register **/
#define ADC3_JSQR			MMIO32(ADC3_BASE + 0x4c)
/** ADC3_OFR1 ADC offset number 1 register **/
#define ADC3_OFR1			MMIO32(ADC3_BASE + 0x60)
/** ADC3_OFR2 ADC offset number 2 register **/
#define ADC3_OFR2			MMIO32(ADC3_BASE + 0x64)
/** ADC3_OFR3 ADC offset number 3 register **/
#define ADC3_OFR3			MMIO32(ADC3_BASE + 0x68)
/** ADC3_OFR4 ADC offset number 4 register **/
#define ADC3_OFR4			MMIO32(ADC3_BASE + 0x6c)
/** ADC3_JDR1 ADC group injected sequencer rank 1 register **/
#define ADC3_JDR1			MMIO32(ADC3_BASE + 0x80)
/** ADC3_JDR2 ADC group injected sequencer rank 2 register **/
#define ADC3_JDR2			MMIO32(ADC3_BASE + 0x84)
/** ADC3_JDR3 ADC group injected sequencer rank 3 register **/
#define ADC3_JDR3			MMIO32(ADC3_BASE + 0x88)
/** ADC3_JDR4 ADC group injected sequencer rank 4 register **/
#define ADC3_JDR4			MMIO32(ADC3_BASE + 0x8c)
/** ADC3_AWD2CR ADC analog watchdog 2 configuration register **/
#define ADC3_AWD2CR			MMIO32(ADC3_BASE + 0xa0)
/** ADC3_AWD3CR ADC analog watchdog 3 configuration register **/
#define ADC3_AWD3CR			MMIO32(ADC3_BASE + 0xa4)
/** ADC3_LTR2 ADC watchdog lower threshold register 2 **/
#define ADC3_LTR2			MMIO32(ADC3_BASE + 0xb0)
/** ADC3_HTR2 ADC watchdog higher threshold register 2 **/
#define ADC3_HTR2			MMIO32(ADC3_BASE + 0xb4)
/** ADC3_LTR3 ADC watchdog lower threshold register 3 **/
#define ADC3_LTR3			MMIO32(ADC3_BASE + 0xb8)
/** ADC3_HTR3 ADC watchdog higher threshold register 3 **/
#define ADC3_HTR3			MMIO32(ADC3_BASE + 0xbc)
/** ADC3_DIFSEL ADC channel differential or single-ended mode selection register **/
#define ADC3_DIFSEL			MMIO32(ADC3_BASE + 0xc0)
/** ADC3_CALFACT ADC calibration factors register **/
#define ADC3_CALFACT			MMIO32(ADC3_BASE + 0xc4)
/** ADC3_CALFACT2 ADC Calibration Factor register 2 **/
#define ADC3_CALFACT2			MMIO32(ADC3_BASE + 0xc8)

/**@}*/


/** @defgroup adc3_isr ISR ADC interrupt and status register
@{*/

/** ADC3_ISR_JQOVF ADC group injected contexts queue overflow flag **/
#define ADC3_ISR_JQOVF		(1 << 10)
/** ADC3_ISR_AWD3 ADC analog watchdog 3 flag **/
#define ADC3_ISR_AWD3		(1 << 9)
/** ADC3_ISR_AWD2 ADC analog watchdog 2 flag **/
#define ADC3_ISR_AWD2		(1 << 8)
/** ADC3_ISR_AWD1 ADC analog watchdog 1 flag **/
#define ADC3_ISR_AWD1		(1 << 7)
/** ADC3_ISR_JEOS ADC group injected end of sequence conversions flag **/
#define ADC3_ISR_JEOS		(1 << 6)
/** ADC3_ISR_JEOC ADC group injected end of unitary conversion flag **/
#define ADC3_ISR_JEOC		(1 << 5)
/** ADC3_ISR_OVR ADC group regular overrun flag **/
#define ADC3_ISR_OVR		(1 << 4)
/** ADC3_ISR_EOS ADC group regular end of sequence conversions flag **/
#define ADC3_ISR_EOS		(1 << 3)
/** ADC3_ISR_EOC ADC group regular end of unitary conversion flag **/
#define ADC3_ISR_EOC		(1 << 2)
/** ADC3_ISR_EOSMP ADC group regular end of sampling flag **/
#define ADC3_ISR_EOSMP		(1 << 1)
/** ADC3_ISR_ADRDY ADC ready flag **/
#define ADC3_ISR_ADRDY		(1 << 0)

/**@}*/

/** @defgroup adc3_ier IER ADC interrupt enable register
@{*/

/** ADC3_IER_JQOVFIE ADC group injected contexts queue overflow interrupt **/
#define ADC3_IER_JQOVFIE		(1 << 10)
/** ADC3_IER_AWD3IE ADC analog watchdog 3 interrupt **/
#define ADC3_IER_AWD3IE		(1 << 9)
/** ADC3_IER_AWD2IE ADC analog watchdog 2 interrupt **/
#define ADC3_IER_AWD2IE		(1 << 8)
/** ADC3_IER_AWD1IE ADC analog watchdog 1 interrupt **/
#define ADC3_IER_AWD1IE		(1 << 7)
/** ADC3_IER_JEOSIE ADC group injected end of sequence conversions interrupt **/
#define ADC3_IER_JEOSIE		(1 << 6)
/** ADC3_IER_JEOCIE ADC group injected end of unitary conversion interrupt **/
#define ADC3_IER_JEOCIE		(1 << 5)
/** ADC3_IER_OVRIE ADC group regular overrun interrupt **/
#define ADC3_IER_OVRIE		(1 << 4)
/** ADC3_IER_EOSIE ADC group regular end of sequence conversions interrupt **/
#define ADC3_IER_EOSIE		(1 << 3)
/** ADC3_IER_EOCIE ADC group regular end of unitary conversion interrupt **/
#define ADC3_IER_EOCIE		(1 << 2)
/** ADC3_IER_EOSMPIE ADC group regular end of sampling interrupt **/
#define ADC3_IER_EOSMPIE		(1 << 1)
/** ADC3_IER_ADRDYIE ADC ready interrupt **/
#define ADC3_IER_ADRDYIE		(1 << 0)

/**@}*/

/** @defgroup adc3_cr CR ADC control register
@{*/

/** ADC3_CR_ADCAL ADC calibration **/
#define ADC3_CR_ADCAL		(1 << 31)
/** ADC3_CR_ADCALDIF ADC differential mode for calibration **/
#define ADC3_CR_ADCALDIF		(1 << 30)
/** ADC3_CR_DEEPPWD ADC deep power down enable **/
#define ADC3_CR_DEEPPWD		(1 << 29)
/** ADC3_CR_ADVREGEN ADC voltage regulator enable **/
#define ADC3_CR_ADVREGEN		(1 << 28)
/** ADC3_CR_LINCALRDYW6 Linearity calibration ready Word 6 **/
#define ADC3_CR_LINCALRDYW6		(1 << 27)
/** ADC3_CR_LINCALRDYW5 Linearity calibration ready Word 5 **/
#define ADC3_CR_LINCALRDYW5		(1 << 26)
/** ADC3_CR_LINCALRDYW4 Linearity calibration ready Word 4 **/
#define ADC3_CR_LINCALRDYW4		(1 << 25)
/** ADC3_CR_LINCALRDYW3 Linearity calibration ready Word 3 **/
#define ADC3_CR_LINCALRDYW3		(1 << 24)
/** ADC3_CR_LINCALRDYW2 Linearity calibration ready Word 2 **/
#define ADC3_CR_LINCALRDYW2		(1 << 23)
/** ADC3_CR_LINCALRDYW1 Linearity calibration ready Word 1 **/
#define ADC3_CR_LINCALRDYW1		(1 << 22)
/** ADC3_CR_ADCALLIN Linearity calibration **/
#define ADC3_CR_ADCALLIN		(1 << 16)

#define ADC3_CR_BOOST_SHIFT		8
#define ADC3_CR_BOOST_MASK		0x03
/** @defgroup adc3_cr_boost BOOST Boost mode control
@{*/
/**@}*/

/** ADC3_CR_JADSTP ADC group injected conversion stop **/
#define ADC3_CR_JADSTP		(1 << 5)
/** ADC3_CR_ADSTP ADC group regular conversion stop **/
#define ADC3_CR_ADSTP		(1 << 4)
/** ADC3_CR_JADSTART ADC group injected conversion start **/
#define ADC3_CR_JADSTART		(1 << 3)
/** ADC3_CR_ADSTART ADC group regular conversion start **/
#define ADC3_CR_ADSTART		(1 << 2)
/** ADC3_CR_ADDIS ADC disable **/
#define ADC3_CR_ADDIS		(1 << 1)
/** ADC3_CR_ADEN ADC enable **/
#define ADC3_CR_ADEN		(1 << 0)

/**@}*/

/** @defgroup adc3_ccr CCR ADC common control register
@{*/

/** ADC3_CCR_VBATEN VBAT enable **/
#define ADC3_CCR_VBATEN		(1 << 24)
/** ADC3_CCR_TSEN Temperature sensor enable **/
#define ADC3_CCR_TSEN		(1 << 23)
/** ADC3_CCR_VREFEN VREFINT enable **/
#define ADC3_CCR_VREFEN		(1 << 22)

